{
  "root_url": "https://aranya.gov.in/aranyacms/(S(e4iqljncbsamwh32ut40plbs))/English/Home.aspx",
  "pages": {
    "/aranyacms/(S(e4iqljncbsamwh32ut40plbs))/English/Home.aspx": {
      "url": "https://aranya.gov.in/aranyacms/(S(e4iqljncbsamwh32ut40plbs))/English/Home.aspx",
      "title": "Karnataka Forest Department - Home page",
      "text": "Karnataka Forest Department - Home page Karnataka Forest Department - Home Page About us Forests provide the basic life support system to all the living beings of mother earth including mankind. Forest ecosystems provide fresh air, water resources, fertile soil for sustenance of agriculture, bio-diversity, climate change mitigation and numerous other ecosystem services. Vast sections of rural society, including a majority of the tribals, are directly dependent on forests for their livelihood. The Karnataka Forest Department has the primary mandate of protecting the forests and wildlife, conserving the rich biodiversity of the state and ensuring that the ecological balance of the forest eco-systems is maintained. The Department is headed by Principal Chief Conservator of Forests, Head of Forest Force(HOFF). The Department presently has a total working strength of around 8000 executive personnel including Indian Forest Service Officers and officers/ field staff of various cadres. The total recorded forest area of the State is 43,382 sq. km. The State has a network of Protected Areas with 5 Tiger Reserves, 30 Wildlife Sanctuaries, 15 Conservation Reserves and 1 Community Reserve. The work carried out by the Department can be broadly classified into the following categories: regulatory, protection, conservation and sustainable management. As part of the regulatory functions, the department enforces provisions of various legislations such as Karnataka Forest Act 1963, Wildlife Protection Act 1972, Forest (Conservation) Act 1980, Karnataka Preservation of Trees Act 1976, etc. and corresponding rules. Protection functions include, boundary consolidation, protection of forest areas from encroachment, illicit-felling, mitigation of human-wildlife conflict, undertaking fire prevention and control measures etc. The conservation functions include taking up of plantation works, soil-moisture conservation and watershed development works for water security, conservation of rare, endangered and threatened (RET) species and conducting awareness activities to sensitize all sections of the society on the importance of forests, wildlife and biodiversity. In territorial areas, the department is also involved in sustainable extraction and marketing of timber and other forest produce as per the specifications of the Working Plans. The Department is also engaged on a large scale in promoting agro-forestry through incentivization to support farmer’s income. Sri. Siddaramaiah Hon'ble Chief Minister, Government of Karnataka Sri. Eshwar B Khandre Hon'ble Minister,Forest Ecology and Environment Dept. Government of Karnataka Shri. Anjum Parwez, IAS Additional Chief Secretary, FEE Dr. Meenakshi Negi, IFS Principal Chief Conservator of Forests & Head of Forest Force (HoFF) Shri. Manoj Kumar, IFS Principal Secretary (Forests) News & Updates Regarding draft seniority list of Deputy Range Forest Officers cum Surveyors of Mysore Circle for the period from 27-04-1978 to 31-12-2019 Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Bengaluru Circle Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Chikmagalur Circle Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Chamarajanagar Circle. Disposal of objections and final list regarding recruitment of Beat Foresters in Bangalore, Chikmagalur and Chamarajanagar Circles Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Kalburgi Circle. Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Ballari Circle. Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Kodagu Circle. Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Mysore Circle. Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Belagavi Circle Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Hassan Circle. Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Mangalore Circle. Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Canara Circle. Regarding verification of original documents- pertaining to direct recruitment of Beat Foresters in Shimoga Circle. Disposal of objections and final list regarding recruitment of Beat Foresters in 10 circles excluding Bangalore, Chikmagalur and Chamarajanagar Circles Disposal of objections and revised provisional list for the post of Beat Foresters in Bangalore, Chikmagalur and Chamarajanagar Circles Corrigendum to notification No: KFD/HOFF/B9(RCT)/3/2022-PnR-KFD, dated: 17-11-2023, regarding provisional list of candidates for the post of Forest Guards (Beat Foresters), dated: 18-10-2025 Corrigendum to notification no: KFD/HOFF/B9(RCT)/3/2022-PnR-KFD, dated: 17-11-2023 1:1 Provisional list of Candidates for direct recruitment to the post of Beat Foresters /Forest Guards (540 Nos.) during 2023-24 Inviting Quotations for Supply of CM Medals-regarding, Key answers for the Written examination conducted on 20-07-2025 for the direct recruitment of 540 candidates to the post of Beat Foresters Provisional list of candidates permitted to appear in Written Examination for the post of Beat Foresters in Mysore Circle vide interim Order of Honble High Court Regarding Corrigendum to Application ID in the list of Eligible and Ineligible list of candidates published obn 12-06-2025, for the written examination to the post of Beat Foresters in Kodagu Circle Regarding Corrigendum to Application ID in the list of Eligible and Ineligible list of candidates published obn 12-06-2025, for the written examination to the post of Beat Foresters in Canara Circle Regarding date, time and venue for written examination for the post of Beat Foresters in Kodagu Circle Regarding List of candidates eligible for Written examination to the post of Beat Foresters (26 Nos) in Kalburgi Circle vide notification of 2023-24 Addendum/Corrigendum to the list of eligible and ineligible candidates for written examination to the post of Beat Foresters in Canara Circle Regarding Written examination to the post of Beat Foresters (540 Nos) vide notification of 2023-24 Regarding re-medical examination of Sri. Bhaganna Chitagi, for the post of Beat Forester in Kalburgi Circle Lists of eligible candidates for the post of Beat Forest Officers in Hassan Circle Lists of eligible and ineligible candidates for the post of Beat Forest Officers in Chamarajanagara Circle Conducting re examination for physical standards of the appealed and other candidates for the post of Forest Guards (Beat foresters)- Bangalore Circle Remedical examination for apprealed candiadtes for the post of Forest Guards (Beat foresters)- Shimoga Circle Regarding conducting physical examination of Sri. Akash S S for the post of Beat Forester in Chikmagalur Circle. Regarding conducting re-medical examination of 76 appealed candidates who were disqualified in the medical test conducted between 16-04-2025 to 21-04-2025, for the post of Beat Foresters in Kanara Circle Regarding inviting objections for the list of candidates eligible in the Physical endurance/ Physical test in Mysore Circle for the post of Beat Foresters Regarding conducting medical re-examination of the candidates (who had appealed for the same) for the post of Beat Foresters in Mangalore Circle Regarding publishing of revised tentative list of candidates eligible in the Physical endurance/ Physical test in Mangalore Circle for the post of beat Foresters List of eligible and ineligible candidates for Written examination for the post of Beat Foresters in Chamarajanagara Circle List of candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held betwwen 20-04-2025 to 28-04-2025 for candidates for the post of Beat Foresters in Kalburgi Circle and list of candidate who have to reappear for medical test. List of eligible / ineligible candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held on 16-04-2025 to 18-04-2025 for candidates for the post of Beat Foresters in Ballari Circle List of eligible / ineligible candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held on 17-04-2025 to 23-04-2025 for candidates for the post of Beat Foresters in Kodagu Circle Regarding publication of final list of candidates eligible for Written exam for the direct recruitment to the post of beat Foresters in Dharwad Circle during 2023-24 Tentative list of Waiting list candidates for the post of Forest Watchers in Kalyana Karnataka region in Ballari Circle Tentative List of eligible in the Physical Endurance, Efficiency Test and Physical Standard Test held on 16-04-2025, 17-04-2025 , 16-04-2025 to 19-04-2025 for candidates for the post of Beat Foresters in Belagavi Circle List of eligible / ineligible candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held on 17-04-2025 to 22-04-2025 for candidates for the post of Beat Foresters in Bengaluru Circle List of eligible candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held on 16-04-2025, 17-04-2025 , 19-04-2025 & 21-04-2025 for candidates for the post of Beat Foresters in Mangalore Circle Regarding Written Examination for recruitment to the post of Beat Forest Officers in Hassan Circle List of eligible / ineligible candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held on 16-04-2025, 17-04-2025 , 19-04-2025 & 21-04-2025 for candidates for the post of Beat Foresters in Canara Circle Physical standard, physical endurance and physical efficiency test for physically handicapped candidates, for the post of Forest Guards (Beat foresters)- Kalburgi Circle List of eligible candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held on 16-04-2025 for candidates for the post of Beat Foresters in Dharwad Circle List of eligible / ineligible candidates in the Physical Endurance, Efficiency Test and Physical Standard Test held on 16-04-2025 and 17-04-2025 for candidates for the post of Beat Foresters in Chikkamagaluru Circle Regarding Physical Standard test and Document verification of candidates for the post of Beat Foresters of Bangalore Circle Regarding addition of name to the list of candidates for physical endurance test for the post of Beat Forester in Mangalore Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Dharwad Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Ballari Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Chamarajanagara Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Kalburgi Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Shimoga Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Kodagu Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Canara Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- BelagaviCircle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Bengaluru Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Mysore Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Hassan Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters)- Mangalore Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters) in Chamarajanagara Circle Regarding publication of final additional list of candidates to the post of forest watchers- Mysore Circle Physical standard, physical endurance and physical efficiency test for candiadtes for the post of Forest Guards (Beat foresters) in Chikmagalur Circle Regarding publication of Final Waiting list for the direct recruitment of Candidates during 2023-24 to the cadre of Forest Watcher Verification of HR database and furnishing details of employees waiting for posting Recruitment to RFO cadre- 10 Posts-HK - Annexure-I &II dated: 04-05-2024 Publication of draft additional list of candidates against direct recruitment to the post of Forest Watchers Regarding publication of provisional Waiting list of candidates for direct recruit of Forest Watches in Kanara Circle during 2023-24 Regarding including Sri. Basavaraja Mallappa Pujari & Sri. Nisar, DRFO Cum Surveyors under Kalyana Karnataka Local cadre vide Article 371(j) if the Constitution Regarding Physical Endurance test and Physical Efficiency test and Physical Standard Test for recruitment to the post of Forest Beat Foresters cadre (540 Posts) Supplementary Notification dated: 04-01-2025 to the Notification No: KFD/HOFF/B9(MSC)/1/2020-PnR-KFD, dated: 08-11-2024, regarding quarterly Contingent Transfers/Postings during 2024-25 Regarding Cancellation of candidature of ed candidate against therecruitment for the post of 25 Forest Watchers (D-Group) in Chikmagalur Circle dated: 24-10-2024 Second List of eligible candidates for the post of 25 Forest Watchers (D-Group) in Chikmagalur Circle dated: 16-09-2023, dated: 26-12-2024 Second Provisional List of eligible candidates for the post of 25 Forest Watchers (D-Group) in Chikmagalur Circle dated: 09-12-2024 Awarding Chief Ministers Medal to Officers and Staff of Forest Department during the yera 2024- regarding Regarding direct recruitment of 25 Forest Watchers in Chikmagalur Circle in 2023-24- 2nd Provisional List Regarding cancellation of final ion of candidate ed for the post of Forest Watcher in Hassan Circle for furnishing non-authentic medical certificate Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (29 Nos.) during 2023-24, in Ballari Circle Constitution of Project Monitoring and Evaluation Unit for Projects under CEPMIZ in Karnataka Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (49 Nos.) during 2023-24, in Bangalore Circle Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (47 Nos.) during 2023-24, in Mysore Circle Corrigendum to Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (49 Nos.) during 2023-24, in Bangalore Circle Final list of eligible candidates for direct recruitment for the post of Beat Foresters (26 Nos.) during 2023-24, in Kalburgi Circle Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (57 Nos.) during 2023-24, in Mangalore Circle Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (61 Nos.) during 2023-24, in Shimoga Circle Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (58 Nos.) during 2023-24, in Canara Circle Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (83 Nos.) during 2023-24, in Chamarajanagar Circle Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (52 Nos.) during 2023-24, in Chikmagalur Circle Final list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (18 Nos.) during 2023-24, in Hassan Circle Corrigendum to Final list of eligible candidates for direct recruitment for the post of Beat Foresters (33 Nos.) during 2023-24, in Kodagu Circle Final eligible list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (12 Nos.) during 2023-24, in Belagavi Circle Corrigendum to Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (18 Nos.) during 2023-24, in Hassan Circle, Dated: 13-08-2024 Final list of eligible candidates for direct recruitment for the post of Beat Foresters (33 Nos.) during 2023-24, in Kodagu Circle Final list of eligible candidates for direct recruitment for the post of Beat Foresters (05 Nos.) during 2023-24, in Dharwad Circle Corrigendum to publication of tentative list of eligible candidates for direct recruitment for the post of Beat Foresters (57 Nos) during 2023-24 in Mangaluru Circle OM for Compliance of KAT A No 2064 Of 2012 Order dated 30.01.2018 - Sri. Praveen Kumar N RFO (Candidate) vs State Provisional list of eligible candidates for direct recruitment for the post of Beat Foresters (26 Nos.) during 2023-24, in Kalburgi Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (49 Nos.) during 2023-24, in Bangalore Circle Corrigendum to provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (52 Nos.) during 2023-24, in Chikmagalur Circle Corrigendum to Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (18 Nos.) during 2023-24, in Hassan Circle Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (47 Nos.) during 2023-24, in Mysore Circle Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (61 Nos.) during 2023-24, in Shimoga Circle Corrigendum to Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (29 Nos.) during 2023-24, in Ballari Circle Corrigendum to Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (83 Nos.) during 2023-24, in Chamarajanagar Circle Provisional list of 1:20 eligible candidates for direct recruitment for the post of Beat Foresters (29 Nos.) during 2023-24, in Ballari Circle Regarding publication of tentative list of eligible candidates for direct recruitment for the post of Beat Foresters (57 Nos) during 2023-24 in Mangaluru Circle Regarding publication of tentative list of eligible candidates for direct recruitment for the post of Beat Foresters (83 Nos) during 2023-24 in Chamarajanagar Circle Regarding publication of tentative list of eligible candidates for direct recruitment for the post of Beat Foresters (Group C) 10+2 (Backlog) during 2023-24 in Belagavi Circle Regarding publication of tentative list of eligible candidates for direct recruitment for the post of Beat Foresters (Group C) 50 2 (Backlog) during 2023-24 in Chikkamagluru Circle Regarding publication of tentative list of eligible candidates for direct recruitment for the post of Beat Foresters (Group C) 58 (Backlog) during 2023-24 in Canara Circle Tentative list of eligible candidates for direct recruitment for the post of Beat Foresters (05 Nos.) during 2023-24, in Dharwad Circle Corrigendum to annexure to the list of candidates not eligible for direct recruitment for the post of Beat Foresters (61 Nos.) during 2023-61, in Shimoga Circle published on 20-07-2024 Revised List of candidates not eligible for direct recruitment for the post of Beat Foresters (18 Nos.) during 2023-24, in Hassan Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (33 Nos.) during 2023-24 in Kodagu Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (61 Nos.) during 2023-24, in Shimoga Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (28 Nos.) during 2023-24, in Ballari Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (26 Nos.) during 2023-24, in Kalburgi Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (57 Nos.) during 2023-24, in Mangalore Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (47 Nos.) during 2023-24, in Mysore Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (12 Nos.) during 2023-24, in Belagavi Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (18 Nos.) during 2023-24, in Hassan Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (49 Nos.) during 2023-24, in Bangalore Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (83 Nos.) during 2023-24, in Chamarajanagar Circle 2023-24 ನೇ ಸಾಲಿನಲ್ಲಿ ಚಿಕ್ಕಮಗಳೂರು ವೃತ್ತದ 52 ಗಸ್ತು ಅರಣ್ಯ ಪಾಲಕ (ಗ್ರೂಪ್‌ ಸಿ) ವೃಂದದ ಹುದ್ದೆಗಳಿಗೆ ನೇರ ನೇಮಕಾತಿಗೆ ಸಂಬಂಧಿಸಿದಂತೆ ಅನರ್ಹ ಅಭ್ಯರ್ಥಿಗಳ ಪಟ್ಟಿ List of candidates not eligible for direct recruitment for the post of Beat Foresters (58 Nos.) during 2023-24, in Canara Circle List of candidates not eligible for direct recruitment for the post of Beat Foresters (05 Nos.) during 2023-24, in Dharwad Circle Eligible candidate list for written exam for direct recruitment of 10 HK reserved posts publication Objection and reply for Kalyana Karnataka reserved 10 RFO posts. Eligible candidate list for written exam for direct recruitment of 10 HK reserved posts. Range Forest Officers Written exam syllabus Notification for General Transfers/Postings during 2024-25 vide No. KFD/HOFF/B9(MSC)/1/2020-PnR-KFD, DATE:06/07-06-2024 with revised annexures as on 15-06-2024 Submission of Objections to list pertaining to recruitment to the post of Forest Watchers (Group-D) in Chikmagalur circle vide Notification No: A4/EST/Recruitment/CR-25/2023-24 dated: 16-09-2023 Notification for General Transfers/Postings during 2024-25 vide No. KFD/HOFF/B9(MSC)/1/2020-PnR-KFD, DATE:06/07-06-2024 RFP-Procurement of Services of a consultancy firm by the Karnataka Eco Restoration Society (KERS) to prepare DPRs for the K-SHORE project Regarding publication of draft seniority list of Elephant Mahuts of Chamarajanagara Circle, for the period dated : 01-01-2022 to 31-12-2023 Regarding publication of draft seniority list of Elephant Kavaadi of Chamarajanagara Circle, for the period dated : 01-01-2022 to 31-12-2023 Regarding publication of draft seniority list of Elephant Jamedars of Chamarajanagara Circle, for the period dated : 01-01-2022 to 31-12-2023 Regarding publication of final seniority list of Forest Watchers of Bangalore Circle for period from 10-12-2021 to 31-12-2023 Regarding publication of final seniority list of D-group employees of Bangalore Circle for period from 10-12-2021 to 31-12-2023 Regarding Publication of Draft Seniority List of Assistant Conservator of Forests as on 01-01-2024 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Mangalore Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 27 Forest Watch Posts in Chamarajanagara Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 16 Forest Watch Posts in Kodagu Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 30 Forest Watch Posts in Shimoga Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Ballari Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 23 Forest Watch Posts in Kalburgi Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 32 Forest Watch Posts in Canara Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Belagavi Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 32 Forest Watch Posts in Mysore Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 07 Forest Watch Posts in Dharwad Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 33 Forest Watch Posts in Bengaluru Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 25 Forest Watch Posts in Chikkamagaluru Circle for the year 2023-24 Final List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Hassan Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 16 Forest Watch Posts in Kodagu Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 23 Forest Watch Posts in Kalburgi Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Ballari Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 07 Forest Watch Posts in Dharwad Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 32 Forest Watch Posts in Mysore Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 32 Forest Watch Posts in Canara Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 30 Forest Watch Posts in Shimoga Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Mangalore Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 27 Forest Watch Posts in Chamarajanagar Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 25 Forest Watch Posts in Chikkamagaluru Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Hassan Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 20 Forest Watch Posts in Belagavi Circle for the year 2023-24 Provisional List of 1:1 (Post: Candidate) for Direct Recruitment to 33 Forest Watch Posts in Bangalore Circle for the year 2023-24 List of qualified and disqualified candidates in various tests conducted for direct recruitment of 25 forest watchers in Chikmagalur Circle, during the year 2023-24 Counselling Authority wise Priority lists to Notification regarding Contingent Transfers/Postings vide notification no.:KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024, revised as on 06-03-2024 List of candidates eligible for original document verification upon qualifying in the medical test for direct recruitment of 30 forest watchers posts in Shimoga circle during 2023-24 Revised Priority list of employees for Contingent Transfer/Counselling vide Notification No. KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024- As on 03-03-2024 Revised Annexures to Notification regarding Contingent Transfers/Postings vide notification no.:KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024, as on 02-03-2024 Counselling authority wise Priority list of employees to be counselled for contingent transfers/postings vide Notification No: KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 24/25-01-2024 Counselling Dates- Notification No: KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 24/25-01-2024 and 01-03-2024 Medical test and document verification for candidates who qualified in Physical test for direct recruitment of 32 no. of forest watcher posts in Mysore Circle during 2023-24 Supplementary notification dated- 01-03-2024, to Notification No: KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2023- Notification of counselling Date List of qualified candidates in Physical Endurance Test dated:29-02-2024 for Direct Recruitment of 32 Forest Watcher Group D Posts in Mysore Circle for the year 2023-24 List of qualified & disqualified candidates in Physical Endurance Test dated:29-02-2024 for Direct Recruitment of 25 Forest Watcher Group D Posts in Chikkamagaluru Circle for the year 2023-2 Original document verification for direct recruitment to 33 Forest Watchers Group D posts in Bangalore circle for the year 2023-24 Details of objection and action taken on consideration of the objection regarding provisional ion list of forest watchers of Hassan Circle published on 14-02-2024 Corrigendum to candidates listed in 1:20 final list for recruitment of 25 no. Forest Watchers (Group-D) in Chikkamagaluru Circle for the year 2023-24 Regarding submission of original documents by Sri. Keshavamurthy.V.C vide recruitment of Range Forest Officers vide notification no: B9/recruitment/CR-3/2017-18, dated: 24-03-2018 Corrigendum to candidates listed in 1:20 final list for recruitment of 20 no. Forest Watchers (Group-D) in Belagavi Circle for the year 2023-24 Corrigendum to Physical, medical test and document verification for candidates listed in 1:20 final list for recruitment of 20 no. Forest Watchers (Group-D) in Hassan Circle for the year 2023-24 Physical and medical test and document verification for candidates listed in 1:20 final list for direct recruitment of 23 no. Forest Watchers (Group-D) in Kalburgi Circle for the year 2023-24 Physical and medical test and document verification for candidates listed in 1:20 final list for direct recruitment of 20 no. Forest Watchers (Group-D) in Hassan Circle for the year 2023-24. Physical and medical test and document verification for candidates listed in 1:20 final list for direct recruitment of 20 no. Forest Watchers (Group-D) in Mangalore Circle for the year 2023-24 Physical and medical test and document verification for candidates listed in 1:20 final list for direct recruitment of 27 Forest Watchers (Group-D) in Chamarajanagara Circle for the year 2023-24 Physical endurance/efficiency/medical test & document verification for candidates listed in 1:20 final list for direct recruitment of 25 no. Forest Watchers (Group-D) in Chikmagalur Circle for 2023-24 Physical endurance/efficiency/medical test and document verification for candidates listed in 1:20 final list for direct recruitment of 32 no. Forest Watchers (Group-D) in Canara Circle for 2023-24 Physical endurance/efficiency/medical test for candidates listed in 1:20 final list for direct recruitment of 30 no. Forest Watchers (Group-D) in Shimoga Circle for the year 2023-24 Final 1:20 list of candidates for direct recruitment of 20 no. Forest Watchers (Group-D) in Ballari Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 33 no. Forest Watchers (Group-D) in Bangalore Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 23 no. Forest Watchers (Group-D) in Kalburgi Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 07 no. Forest Watchers (Group-D) in Dharwad Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 27 no. Forest Watchers (Group-D) in Chamarajanagara Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 25 no. Forest Watchers (Group-D) in Chikkamagalur Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 20 no. Forest Watchers (Group-D) in Hassan Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 20 no. Forest Watchers (Group-D) in Mangalore Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 30 no. Forest Watchers (Group-D) in Shimoga Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 32 no. Forest Watchers (Group-D) in Mysore Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 16 no. Forest Watchers (Group-D) in Kodagu Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 32 no. Forest Watchers (Group-D) in Canara Circle for the year 2023-24 and publication regarding physical endurance tests. Final 1:20 list of candidates for direct recruitment of 20 no. Forest Watchers (Group-D) in Belagavi Circle for the year 2023-24 and publication regarding physical endurance tests. Revised Annexures to Notification regarding Contingent Transfers/Postings vide notification no.:KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024, as on 15-02-2024 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 32 no. Forest Watchers (Group-D) in Mysore Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 30 no. Forest Watchers (Group-D) in Shimoga Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 23 no. Forest Watchers (Group-D) in Kalburgi Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 32 no. Forest Watchers (Group-D) in Canara Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 25 no. Forest Watchers (Group-D) in Chikkamagaluru Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 16 no. Forest Watchers (Group-D) in Kodagu Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 20 no. Forest Watchers (Group-D) in Belagavi Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 20 no. Forest Watchers (Group-D) in Hassan Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 20 no. Forest Watchers (Group-D) in Ballari Circle for the year 2023-24 Regarding publication of 1:20 Provisional list of candidates for direct recruitment of 33 no. Forest Watchers (Group-D) in Bangalore Circle for the year 2023-24 1:20 Provisional list of candidates for direct recruitment of 27 no. Forest Watchers (Group-D) in Chamrajanagara Circle for the year 2023-24 1:20 Provisional list of candidates for direct recruitment of 7 no. Forest Watchers (Group-D) in Dharwad Circle for the year 2023-24 1:20 Provisional List for Direct Recruitment to 20 Forest Watcher Group D Posts in Mangalore Circle for the year 2023-24 Corrigendum to Notification pertaining to recruitment of 30 Forest watchers (Group D) for the year 2023-24 in Shimoga Circle Revised Annexures to Notification regarding Contingent Transfers/Postings vide notification no.:KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024, as on 07-02-2024 Revised Annexures to Notification regarding Contingent Transfers/Postings vide notification no.:KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024, as on 06-02-2024 Invitation of Quotation for supply of CM medal Revised Annexures to Notification regarding Contingent Transfers/Postings vide notification no.:KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024, as on 31-01-2024 Notification regarding Contingent Transfers/Postings vide notification no.:KFD/HOFF/B9(MSC)/1/2020-PnR-KFD dated: 25-01-2024 Corrigendum to Notification pertaining to recruitment of 32 Forest watchers (Group D) for the year 2023-24 in Canara Circle Notification regarding recruitment of Beat Foresters (Forest Guards) during 2023-24 Transfer Order of Range Forest Officers- XVI dated: 22-11-2023 Revised RFO Transfer Order-XV dated-17-11-2023 Order regarding Transfer and Posting of Range Forest Officers-XIV, dated: 16-11-2023 Regarding Ban on Inaguration of Governement works/ buildings etc during Model code of Conduct enforcement period Instructions to candidates listed in final additional list pertaining to recruitment of 339 Forest Guards vide notification no: B9/recruitment/CR-1/2019-20, dated: 02-03-2020 Assigning RFO post to Leopard Task Force Transfer of Range Forest Officers- Order (X) Transfer of Range Forest Officers-VI dated- 15-09-2023 Wildlife Week Celebration-2023: Program List Transfer of Range Foirest Officers- V, dated- 02-09-2023 Transfer of Range Forest Officers-dated 02-09-2023 About Mr. Vinod R. Pattara and Mr. Maruti Guruva have been instructed to give the original documents to the departmental custody as per the information mentioned in the application. Tranfer of Range Forest officers- Dated-29-08-2023 Publication regarding submission of Original Documents- RFO recruitment regarding e-Tender cum e-Auction Notification regarding disposal of Red sanders of seized/confiscated origin and Red sanders seized/confiscated by the Joint Commissioner of Customs, Mangalore Transfer Order (including Modification Order) of Range Forest Officers- Dated-28-08-2023 Transfer of Range Forest Officers-dated 24-08-2023 Regarding earmarking of Circle/Division/Sub-Division/Range wise posts of Range Forest Officer to be newly created and filled in the year 2023-24. 339 Forest Guard Final Additional List Regarding issues such as Punctuality, Unauthorized visits to the Head Office, Uniform, etc. in the Forest Department. Posts to be filled under Contingent Transfers/Postings during 2023-24 COUNSELLING AUTHORITY WISE AND CADRE WISE PRIORITY LIST OF EMPLOYEES SHORTLISTED FOR CONTINGENT TRANSFER (I-QUARTER) DURING 2023-24 ALONG WITH COUNSELLING NOTIFICATION Regarding Deputation of DRFO-cum-Surveyour for Demarcation of the FRL and Tree Enumeration in the Forest Land Falling under the Mekedatu Project. Circle Authority wise revised list of sanctioned posts and employee details- notification Nos: KFD/HOFF/B9(MSC)/1/2020-PnR-KFD(I) & (II), dt: 19-05-2023(as on 30-06-2023) Circle Authority wise list of sanctioned posts and employee details- notification Nos: KFD/HOFF/B9(MSC)/1/2020-PnR-KFD(I) & (II), dt: 19-05-2023 Supplementary Notification dated: 28-06-2023 to the notification No: KFD/HOFF/B9 (MSC)/1/2020-PnR-KFD (II), dated: 19-05-2023- regarding Contingent tr Supplementary Notification dated: 28-06-2023 to the notification No: KFD/HOFF/B9 (MSC)/1/2020-PnR-KFD (I), dated: 19-05-2023- regarding General transf Read More Gallery Explore Karnataka Forest SHOLAS View More EVER GREEN View More MANGROOVES View More MOIST DECIDIOUS View More MYRISTICA SWAMPS(WET EVERGREEN FOREST) View More DRY DECIDIOUS FOREST View More Public Schemes KRISHI ARANYA PROTHSAHA YOJANE, HASSAN View More KRISHI ARANYA PROTHSAHA YOJANE, MANDYA View More KRISHI ARANYA PROTHSAHA YOJANE, VIJAYAPURA View More CHINNARAVANA DARSHANA View More CHINNARAVANA DARSHANA,CHIKKAMAGALURU View More CHINNARAVANA DARSHANA,SHIVAMOGGA View More RAISING OF SEEDLINGS FOR PUBLIC DISTRIBUTION,SHIVAMOGGA View More BENGARE TREE PARK,MANGALURU View More SANJIVINI VANA TREE PARK,DHARWAD View More NAGARAL DAIVIVANA, BAGALKOT View More KAGINELE DAIVIVANA,HAVERI View More CHAMUNDESHWARI DAIVIVANA,MYSURU View More MAGUVUGONDHU MARA SHAALEGONDHU VANA, DAVANGERE View More MAGUVIGONDHU MARA SHAALEGONDHU VANA, YADAGIRI View More MAGUVUGONDHU MARA SHAALEGONDHU VANA View More EXPLORE MAPS | Circle MAPS LIST Administrative Map Circle Division Forest Cover Forest Types Protected Area National Park Tiger Reserve Wildlife Sanctuary Conservation Reserve Community Reserve Nurseries Tree Park ‹ › Copyright © 2019 karnatakaforestdepartment number of visitors - 17283318",
      "metadata": {},
      "forms": []
    }
  }
}